cf_billing/InformationRegisters/бестОбъемыПостоянногоРасхода.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестОбъемыПостоянногоРасхода</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТарифнаяЗона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестОбъемыПостоянногоРасхода/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция - Получить объемы постоянного расхода
//
// Параметры:
//  СтруктураОтборов - Структура из элементов
//						- Период - Дата      
//						- Организация - СправочникСсылка.Организации
//						- Район - СправочникСсылка.энргЗоныОтвественности
//						- ОбъектРасчета - СправочникСсылка.бестОбъектыРасчета
//						- ТочкаУчета - СправочникСсылка.энргТочкиУчета
//						- Услуга - СправочникСсылка.энргВидыУслуг
//						- ТарифнаяЗона - СправочникСсылка.энргТарифныеЗоны
// 
// Возвращаемое значение:
//   - РезультатЗапроса
//
Функция ПолучитьОбъемыПостоянногоРасхода(СтруктураОтборов) Экспорт	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестОбъемыПостоянногоРасходаСрезПоследних.Организация КАК Организация,
		|	бестОбъемыПостоянногоРасходаСрезПоследних.Район КАК Район,
		|	бестОбъемыПостоянногоРасходаСрезПоследних.МКД КАК МКД,
		|	бестОбъемыПостоянногоРасходаСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
		|	бестОбъемыПостоянногоРасходаСрезПоследних.ТочкаУчета КАК ТочкаУчета,
		|	бестОбъемыПостоянногоРасходаСрезПоследних.Услуга КАК Услуга,
		|	бестОбъемыПостоянногоРасходаСрезПоследних.ТарифнаяЗона КАК ТарифнаяЗона,
		|	бестОбъемыПостоянногоРасходаСрезПоследних.Месяц КАК Месяц,
		|	бестОбъемыПостоянногоРасходаСрезПоследних.Объем КАК Объем
		|ИЗ
		|	РегистрСведений.бестОбъемыПостоянногоРасхода.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И ОбъектРасчета = &ОбъектРасчета
		|				И ТочкаУчета = &ТочкаУчета
		|				И Услуга = &Услуга
		|				И ТарифнаяЗона = &ТарифнаяЗона) КАК бестОбъемыПостоянногоРасходаСрезПоследних";
	
	Запрос.УстановитьПараметр("ОбъектРасчета", СтруктураОтборов.ОбъектРасчета);
	Запрос.УстановитьПараметр("Организация", СтруктураОтборов.Организация);
	Запрос.УстановитьПараметр("Период", СтруктураОтборов.Период);
	Запрос.УстановитьПараметр("Район", СтруктураОтборов.Район);
	Запрос.УстановитьПараметр("ТарифнаяЗона", СтруктураОтборов.ТарифнаяЗона);
	Запрос.УстановитьПараметр("ТочкаУчета", СтруктураОтборов.ТочкаУчета);
	Запрос.УстановитьПараметр("Услуга", СтруктураОтборов.Услуга);
	
	Возврат Запрос.Выполнить();
		
КонецФункции

#КонецОбласти

#КонецЕсли
